## SQL

###### Demonstrating few helpful methods of accessing data stored in Databaase

In [1]:
pip install ipython-sql

Collecting ipython-sql
  Downloading https://files.pythonhosted.org/packages/ab/3d/0d38357c620df31cebb056ca1804027112e5c008f4c2c0e16d879996ad9f/ipython_sql-0.4.0-py3-none-any.whl
Collecting prettytable<1 (from ipython-sql)
  Downloading https://files.pythonhosted.org/packages/ef/30/4b0746848746ed5941f052479e7c23d2b56d174b82f4fd34a25e389831f5/prettytable-0.7.2.tar.bz2
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython-sql) (1.3.1)
Requirement already satisfied: ipython>=1.0 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython-sql) (7.4.0)
Requirement already satisfied: six in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython-sql) (0.2.0)
Collecting sqlparse (from ipython-sql)
  Downloading https://files.pythonhosted.org/packages/14/05/6e8eb62ca685b10e34051a80d7ea94b7137369d8c0be5c3b9d9b6e3f5dae/sqlparse-0.4.1-py3-none-any.whl (42kB)
Requirement already satisfied: pygments in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (2.3.1)
Requirement already satisfied: jedi>=0.10 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (0.13.3)
Requirement already satisfied: pickleshare in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (2.0.9)
Requirement already satisfied: setuptools>=18.5 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (41.0.1)
Requirement already satisfied: backcall in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.1)
Requirement already satisfied: decorator in c:\users\louis\onedrive\documents\temp\lib\site-packages (from ipython>=1.0->ipython-sql) (4.4.0)
Requirement already satisfied: parso>=0.3.0 in c:\users\louis\onedrive\documents\temp\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.3.4)
Requirement already satisfied: wcwidth in c:\users\louis\onedrive\documents\temp\lib\site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Building wheels for collected packages: prettytable
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Stored in directory: C:\Users\louis\AppData\Local\pip\Cache\wheels\80\34\1c\3967380d9676d162cb59513bd9dc862d0584e045a162095606
Successfully built prettytable
Installing collected packages: prettytable, sqlparse, ipython-sql
Successfully installed ipython-sql-0.4.0 prettytable-0.7.2 sqlparse-0.4.1
Note: you may need to restart the kernel to use updated packages.

In [7]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [26]:
%config SqlMagic.autopandas = True

In [27]:
import pandas as pd
import sqlite3

In [29]:
%%sql sqlite://
CREATE TABLE president(Fname, Lname, year_of_birth);
INSERT INTO president VALUES('Louis', 'Mothwa', 1993);
INSERT INTO president VALUES('Bongani', 'Nxumalo', 1992);
INSERT INTO president VALUES('Mathapelo', 'Mokgwatsana', 1991);
INSERT INTO president VALUES('Cheesboy', 'Mbao', 1994);
INSERT INTO president VALUES('Vele', 'Matipa', 1992);
INSERT INTO president VALUES('Tom', 'young', 1995);
INSERT INTO president VALUES('Louise', 'Fillipe', 1990);
INSERT INTO president VALUES('Mo', 'Mahwasane', 1986);
INSERT INTO president VALUES('Kay', 'Manamela', 1994);
INSERT INTO president VALUES('Loui', 'Motha', 1963);

Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

Empty DataFrame
Columns: []
Index: []

In [31]:
later_president = %sql SELECT *FROM president WHERE year_of_birth >1986
later_president

 * sqlite://
Done.

       Fname        Lname  year_of_birth
0      Louis       Mothwa           1993
1    Bongani      Nxumalo           1992
2  Mathapelo  Mokgwatsana           1991
3   Cheesboy         Mbao           1994
4       Vele       Matipa           1992
5        Tom        young           1995
6     Louise      Fillipe           1990
7        Kay     Manamela           1994

In [32]:
type(later_president)

pandas.core.frame.DataFrame

In [33]:
con = sqlite3.connect ("president.sqlite")
later_president.to_sql("president", con, if_exists = 'replace')

****UP there we Used Cell magic to query the sql database (inline magic)***

### Now we going to connect through pandas directly

In [43]:
con = sqlite3.connect("president.sqlite")
cur = con.cursor()

new_dataframe = pd.read_sql("SELECT *FROM president", con = con)

con.close()

In [44]:
new_dataframe

   index      Fname        Lname  year_of_birth
0      0      Louis       Mothwa           1993
1      1    Bongani      Nxumalo           1992
2      2  Mathapelo  Mokgwatsana           1991
3      3   Cheesboy         Mbao           1994
4      4       Vele       Matipa           1992
5      5        Tom        young           1995
6      6     Louise      Fillipe           1990
7      7        Kay     Manamela           1994